emacs/init.el
(defvar transmission-mode-map)
(defvar transmission-files-mode-map)
(defvar transmission-torrent-id)
(declare-function transmission-request-async "transmission")
(with-eval-after-load 'transmission
  (define-key transmission-mode-map "M" 'transmission-move)
  (define-key transmission-files-mode-map "R" 'transmission-files-rename-path)

  (defun transmission-files-rename-path (torrent-id old-path new-name)
    "Rename an OLD-PATH to NEW-NAME of TORRENT-ID.

TORRENT-ID is a hashString of torrent.

OLD-PATH is a path to file in a torrent.  It can be a directory
or a file.

NEW-NAME is a new name of a file at OLD-PATH.

When called interactively, values are taken from current buffer
with `transmission-files-mode'.  OLD-PATH can be set explicitly
with prefix argument, otherwise the file at point is taken.

Note: it is forbidden to move a file to other locations, only
renaming is allowed."
    (interactive
     (let* ((old-path (cdr (assq 'name (tabulated-list-get-id))))
            (old-path-prompt (format "Old path (default %s): " old-path))
            (old-path (if current-prefix-arg
                          (read-string old-path-prompt nil nil old-path)
                        old-path))
            (new-name (file-name-nondirectory old-path))
            (new-name-prompt (format "Rename %s to: " new-name))
            (new-name (read-string new-name-prompt nil nil new-name)))
       (list transmission-torrent-id old-path new-name)))

    (when (string= new-name (file-name-nondirectory old-path))
      (user-error "Cannot rename to the same name: %s" new-name))

    (let ((arguments (list :ids (list torrent-id) :path old-path :name new-name)))
      (transmission-request-async nil "torrent-rename-path" arguments))))

(with-eval-after-load 'url-parse
  (define-advice url-generic-parse-url (:around (fn &rest args) save-match-data)
    (save-match-data (apply fn args))))

(add-to-list 'auto-mode-alist (cons (rx ".twig" eos) 'web-mode))

(define-key global-map "\M-V" 'scroll-down-line)
(define-key global-map [?\C-\S-v] 'scroll-up-line)
(define-key global-map [?\C-\M-\S-b] 'previous-buffer)
(define-key global-map [?\C-\M-\S-f] 'next-buffer)
(define-key global-map "\M-Q" 'quit-window)
(define-key global-map "\M-o" 'other-window)

(autoload 'xref-push-marker-stack "xref")
(defun xref-push-marker-stack-ignore-args (&rest _)
  (xref-push-marker-stack))

(load (expand-file-name "nixpkgs/emacs/custom.el" (xdg-config-home)) nil nil t)
